-- 插入第一筆資料，只包含材料品項
INSERT INTO products (pname, pmode, price, pdesc)
VALUES ('瀑布起司牧羊人派', '材料品項', 2000, '即溶土豆泥、牛奶、馬蘇里拉乳酪、肉醬、新鮮歐芹');

-- 插入第二筆資料，包含材料品項和製作步驟
INSERT INTO products (pname, pmode, price, pdesc)
VALUES ('瀑布起司牧羊人派', '材料品項、製作步驟', 12000, '即溶土豆泥、牛奶、馬蘇里拉乳酪、肉醬、新鮮歐芹等材料。製作步驟包括在平底鍋中用中火加熱土豆泥和牛奶，攪拌至順滑，再加入馬蘇里拉乳酪，混合至光滑奶油狀。在烤盤中加入肉醬，均勻塗抹。將土豆和乳酪混合物倒在上面，均勻塗抹，最後撒上剩餘的乳酪。烘烤至金黃色，取出後用新鮮歐芹調味。');

-- 插入第三筆資料，包含材料品項、製作步驟和配方比例
INSERT INTO products (pname, pmode, price, pdesc)
VALUES ('瀑布起司牧羊人派', '材料品項、製作步驟、配方比例', 50000, '即溶土豆泥、牛奶、馬蘇里拉乳酪、肉醬、新鮮歐芹等材料。製作步驟包括在平底鍋中用中火加熱土豆泥和牛奶，攪拌至順滑，再加入馬蘇里拉乳酪，混合至光滑奶油狀。在烤盤中加入肉醬，均勻塗抹。將土豆和乳酪混合物倒在上面，均勻塗抹，最後撒上剩餘的乳酪。烘烤至金黃色，取出後用新鮮歐芹調味。');
